#Изменяемые типы данных и неизменяемые:
"""Неизменяемые: простые (int, float, bool, str, bytes) и кортеж (tuple)
Изменяемые: сложные (list, dict, set, object)
"""
#Как определить тип переменной: 
"""print(type(b))"""
#Как ывпонить явное приведение типов:
"""a = 105.2
   print(float(a))"""
#Конвертирование в разные системы счисления:
"""bin(4)
oct(8)
hex(255)"""

#Операторы в Python:
''' 
-присваивания: 		= += -=
-математические: 	+ - * / % (получение остатка от деления) // (получение числа без остатка) ** (степень)
-сравнения: 		> < >= <= == != <>
-логические:		and or not
-побитовые:		& (и) |	(или) ~ (отрицание) ^ (исключающий ИЛИ)	<< >>
-принадлежности:	in not in
-тождествености:	is is not
-тернальный:		<истина> if <условие> else <ложь>
